outputs/after_wsse_2_pretty.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">
            https://servicios.pre.ertzaintza.eus/A19/registroHostelero/EnvioFicheroXML
        </wsa:Action>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:386193b9-a6c5-4c64-b43c-5a504eeb9357
        </wsa:MessageID>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">
            https://servicios.pre.ertzaintza.eus/A19/registroHostelero/EnvioFicheroXML
        </wsa:To>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <Reference URI="#idBody">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>wCFwLuqBD7PorCEX/0qaOFjDUec=</DigestValue>
                    </Reference>
                    <Reference URI="#idTimestampToken">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>oRRSG9Bn8LKDfvW1G/gSPqWyKmc=</DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue>Rlp5vAAE1y3akxOxq0JOEPFiYlb/VZaqPeSN99qfKl4qdlpnItp+ohIN41y4BAEm
                    NtHY+SnKs1+GOFS/m6xKCMpbi9KROhBsnvwBDwp9uVHivfwygxo6bNwxvgsv0vk4
                    kS350rBtQmkoA5h9DxlE3YVf+/a6uL8ut0KWgkZx9k+k0WoZwMLnGoU71VlG81I+
                    J/j78t5uiNjVzE80ZHjDUhWmSScGEBYrmjdwA8gONg7EtdC+5EeTXoqd5UgKJurB
                    PgjZge38pnUaGi3gMWBH1Herq7f8nYEuNLaVb7Gulp8n1rOuhB5FkwSXlb+lJJfv
                    NRYx22UC6yZ+hVAVYh+TJw==
                </SignatureValue>
                <KeyInfo>
                    <wsse:SecurityTokenReference>
                        <wsse:Reference
                                ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
                                URI="#X509Certificate"/>
                    </wsse:SecurityTokenReference>
                </KeyInfo>
            </Signature>
            <wsse:BinarySecurityToken
                    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
                    EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
                    ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
                    wsu:Id="X509Certificate">
            </wsse:BinarySecurityToken>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#" Id="Signature-2117099736">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                    </CanonicalizationMethod>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <Reference URI="#idBody">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature">
                            </Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue/>
                    </Reference>
                    <Reference URI="#idTimestampToken">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature">
                            </Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue/>
                    </Reference>
                </SignedInfo>
                <SignatureValue/>
                <KeyInfo>
                    <wsse:SecurityTokenReference>
                        <wsse:Reference URI="#idBody"
                                        ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509"/>
                    </wsse:SecurityTokenReference>
                    <KeyValue/>
                </KeyInfo>
            </Signature>
            <wsse:UsernameToken>
                <wsse:Username>a19preempresa</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
                    AqBCBx9bff+Zu6afZgS/x1tOgkE=
                </wsse:Password>
                <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    mBLG09ZYkngJYhYLsIeiDA==
                </wsse:Nonce>
                <wsu:Created
                        xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                    2024-02-11T08:12:50+00:00
                </wsu:Created>
            </wsse:UsernameToken>
            <wsu:Timestamp
                    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                    wsu:Id="idTimestampToken">
                <wsu:Created>2024-02-11T02:12:50Z</wsu:Created>
                <wsu:Expires>2024-02-11T18:52:50Z</wsu:Expires>
            </wsu:Timestamp>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                   ns1:Id="idBody">
        <ns0:envioFicheroXML xmlns:ns0="https://ws.negocio.registroHostelero.a19.gvdi.com">
            <ns0:cabecera>
                <aplicacion>Sistema de comunicaciones para alojamientos</aplicacion>
                <codigoArrendador>B76345879</codigoArrendador>
                <tipoComunicacion>PV</tipoComunicacion>
            </ns0:cabecera>
            <ns0:solicitud>&lt;![CDATA[&lt;alt:peticion
                xmlns:alt="http://www.servicios.ertzaintza.eus/Ertzaintza/ALOJADOS/A19/comunicacionPV"&gt;
                &lt;solicitud&gt;
                &lt;codigoEstablecimiento&gt;480354&lt;/codigoEstablecimiento&gt;
                &lt;comunicacion&gt;
                &lt;contrato&gt;
                &lt;referencia&gt;string&lt;/referencia&gt;
                &lt;fechaContrato&gt;2022-09-29&lt;/fechaContrato&gt;
                &lt;fechaEntrada&gt;2022-09-19T01:18:33&lt;/fechaEntrada&gt;
                &lt;fechaSalida&gt;2022-09-21T19:27:14+02:00&lt;/fechaSalida&gt;
                &lt;numPersonas&gt;2&lt;/numPersonas&gt;
                &lt;numHabitaciones&gt;1&lt;/numHabitaciones&gt;
                &lt;internet&gt;false&lt;/internet&gt;
                &lt;pago&gt;
                &lt;tipoPago&gt;EFECT&lt;/tipoPago&gt;
                &lt;fechaPago&gt;2022-09-29&lt;/fechaPago&gt;
                &lt;/pago&gt;
                &lt;/contrato&gt;
                &lt;persona&gt;
                &lt;rol&gt;VI&lt;/rol&gt;
                &lt;nombre&gt;Juan&lt;/nombre&gt;
                &lt;apellido1&gt;Garcia&lt;/apellido1&gt;
                &lt;apellido2&gt;Garcia&lt;/apellido2&gt;
                &lt;tipoDocumento&gt;NIF&lt;/tipoDocumento&gt;
                &lt;numeroDocumento&gt;000000000T&lt;/numeroDocumento&gt;
                &lt;soporteDocumento&gt;999999999&lt;/soporteDocumento&gt;
                &lt;fechaNacimiento&gt;1999-01-01&lt;/fechaNacimiento&gt;
                &lt;nacionalidad&gt;ESP&lt;/nacionalidad&gt;
                &lt;sexo&gt;H&lt;/sexo&gt;
                &lt;direccion&gt;
                &lt;direccion&gt;C/Serrano 127&lt;/direccion&gt;
                &lt;direccionComplementaria&gt;Portal A. 2B&lt;/direccionComplementaria&gt;
                &lt;codigoMunicipio&gt;28079&lt;/codigoMunicipio&gt;
                &lt;codigoPostal&gt;28001&lt;/codigoPostal&gt;
                &lt;pais&gt;ESP&lt;/pais&gt;
                &lt;/direccion&gt;
                &lt;telefono&gt;666666666&lt;/telefono&gt;
                &lt;correo&gt;juangarcia@correo.es&lt;/correo&gt;
                &lt;/persona&gt;
                &lt;persona&gt;
                &lt;rol&gt;VI&lt;/rol&gt;
                &lt;nombre&gt;Pedro&lt;/nombre&gt;
                &lt;apellido1&gt;Garcia&lt;/apellido1&gt;
                &lt;apellido2&gt;Fernandez&lt;/apellido2&gt;
                &lt;fechaNacimiento&gt;2018-01-01&lt;/fechaNacimiento&gt;
                &lt;nacionalidad&gt;ESP&lt;/nacionalidad&gt;
                &lt;sexo&gt;H&lt;/sexo&gt;
                &lt;direccion&gt;
                &lt;direccion&gt;C/Serrano 127&lt;/direccion&gt;
                &lt;direccionComplementaria&gt;Portal A. 2B&lt;/direccionComplementaria&gt;
                &lt;codigoMunicipio&gt;28079&lt;/codigoMunicipio&gt;
                &lt;codigoPostal&gt;28001&lt;/codigoPostal&gt;
                &lt;pais&gt;ESP&lt;/pais&gt;
                &lt;/direccion&gt;
                &lt;telefono&gt;666666666&lt;/telefono&gt;
                &lt;correo&gt;juangarcia@correo.es&lt;/correo&gt;
                &lt;parentesco&gt;12&lt;/parentesco&gt;
                &lt;/persona&gt;
                &lt;/comunicacion&gt;
                &lt;/solicitud&gt;
                &lt;/alt:peticion&gt;]]&gt;
            </ns0:solicitud>
        </ns0:envioFicheroXML>
    </soap-env:Body>
</soap-env:Envelope>
